// کلید آرایه ها نا مرئی هست و از صفر تا هر خونه ای که وجود دارد میباشد و این مقدار همیشه عددی هستش
let myArr = [10, true, 1.4, "hello",]

// به بخش آبجکت اگر نگاهی بندازی هر کاری اونجا کردیم و هر مقداری داخل ابجکت گذاشتیم همون هم را میتوانیم داخل ارایه بزاریم با این تفاوت که ارایه ها کلید اش مثل آبجگت ها دستی وارد نمیشود و از صفر شروع میشود
let myArr2 = [
    10,
    true,
    1.4,
    "hello",
    [10, 20, 30],
    {
        name: "name",
        myFunc: () => true
    },
    "hello",
    (x) => x - 2,
    (x) => {
        return x + x
    },
    function (x) {
        return x * x
    }
]

myArr2[0]
myArr2[7] // آدرس تابع برمیگردد
myArr2[8](10) // تابع صدا زده میشود


for (let key in myArr2) {
    // میتوانیم به همین روش با استفاده از متغییر و کلید ان مقدار داخل اش را به دست بیاوریم
    if (typeof myArr2[key] == "function") {
        console.log(myArr2[key](15))
    } else {
        console.log(myArr2[key])
    }
}

// وقتی از seperated operator  ها استفاده کردیم باعث شد تک تک خونه های ارایه myarr2 جدا جدا بشن و داخل یک ارایه جدید قرار بگیرند و این عملا مفهوم کپی رو داره میرسونه
let myArr3 = [...myArr2]
// اگر خونه تکراری را با هم اداغم کنیم ادغام میشع و مشکلی هم پیش نمیاد فقط تکراری اضافه میشوند بر خلاف ابجکت ها کلید هاشون جون مشخص نیست تکراری اضافه میشوند
let myArr4 = [...myArr, ...myArr2, ...myArr3, ...myArr3, ...myArr3]
