// متد های کمکی برای دستکاری ارایه ها

// اضافه کردن یک مقدار
myArr4.push(1)

// حذف کردن یک مقدار و بازگشت داده آن مقدار
let x = myArr4.pop()

// اضافه کردن یک مقدار به شروع ارایه
myArr4.unshift(1)

// حذف کردن یک مقدار از شروع ارایه
myArr4.shift()

// تبدیل ارایه به آبجکت
let myObj = Object.assign({}, myArr4)

// let arr = [10, 20, 30];
// ```
//
// * دسترسی:
//
// ```js
// arr[0] // 10
// ```
//
// * طول آرایه:
//
// ```js
// arr.length
// ```
//
// * گرفتن آخرین عنصر:

// arr[arr.length - 1]

// * آرایه می‌تونه انواع داده‌ها و حتی object داشته باشه:

// let arr2 = [10, "hi", true, {name: "Ali"}];
// ```
//
// ---
//
// ### 🔹 شیء (Object)
//
// * مجموعه‌ای از **ویژگی‌ها (key) و مقدار (value)**
// * تعریف:

// let student = {
//   name: "Fatemeh",
//   age: 20,
//   scores: [17,18,19]
// };
// ```
//
// * دسترسی به ویژگی‌ها:

// student.name      // "Fatemeh"
// student["age"]    // 20
// student.scores[0] // 17
// ```
//
// * می‌تونه داخلش آرایه و حتی objectهای دیگه داشته باشه (nested objects)
//
// ---
//
//  آرایه خودش نوعی object هست، ولی indexش عددیه و ویژگی‌هاش نامشخص نیست.

}


