// در مرورگر ها کد های جاواسکریپت جدید مثل import و export کار نمیکنند برای اینکه بتوانند این ها را بشناسند ما از بزار vite استفاده میکنیم
// در مرورگر ها نمیتوانیم دوتا فایل جاوااسکریپت را با هم اداغام کنیم یعنی اینپورت کنیم و فقط میتوانیم دوتا فایل جاوااسکریپت رو جدا از هم از طریق تگ script اضافه کنیم به صفحه و هیچ ارتباطی اینا باهم ندارن
// برای این که بتوانیم چندین فایل را به صورت درختی با هم ایپورت کنیم یا از پکیج های گیت هاب با استفاده از دستور npm استفاده کنیم و نصب کنیم و import کنیم باید مرورگر از کد های ما پشتیانی کند
// برای این کار ما ابزار vite را باید داشته باشیم
// اول از همه باید پروژه ما npm ای باشد
// برای این کار دستور npm init را میزنیم داخل پوشه پروژه مون تا فایل package.json ساخته بشه
// از اینجا به بعد ما میتوانیم هر پکجی رو نصب کنیم و import کنیم
// برای نصب پکیج جدید که از قبل نام اش در package.json وجود ندارن باید دستور npm install <نام پکیج> را اجرا کنیم
// برای نصب پکیج های مورد نیاز باید دستور npm install را اجرا کنیم در صورتی که نام پکیج ها و ورژن شون در package.json از قبل وجود داشته باشد
// حالا میتوانیم vite را با دستور npm i vite نصب کنیم
// و دستور خلاصه اش را به script داخل package.json اضافه کنیم
// "script" :{
// "start":"vite
// }
// بعد از این کار میتوانیم با زدن دستور
// npm run start
// روی ای پی localhost و یک پورت خالی کامپیوتر پروژه مون رو اجرا کنیم تا vite به صورت خودکار کد های javascript جدید را به قدیمی تبدیل کند و از طریق این پورت و ای پی نمایش بدهد
// در اصل کار vite این هست که کد جدید را به قدیمی تبدیل کند و همچنین همه فایل های js ای که ساختیم و import میکنیم را به یک فایل تبدیل کند و فقط همون یک فایل وارد html شود

import _ from "lodash"

let A= _.map([1,2,3], (x) => x+1)
console.log(A)

